HomeWork-3/reports/128M/withIndex/wrk-C100.txt
Running 5m test @ http://localhost:5000
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.30s     6.20s   29.87s    84.34%
    Req/Sec     8.97      9.80   170.00     85.19%
  Latency Distribution
     50%  989.94ms
     75%    6.26s 
     90%   14.09s 
     99%   25.10s 
  10736 requests in 5.00m, 13.51MB read
  Socket errors: connect 0, read 0, write 0, timeout 137
Requests/sec:     35.78
Transfer/sec:     46.10KB