HomeWork-3/reports/128M/withIndex/wrk2-R1.txt
Running 5m test @ http://localhost:5000
  1 threads and 1 connections
  Thread calibration: mean lat.: 51.788ms, rate sampling interval: 201ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    50.27ms   51.63ms 530.94ms   93.79%
    Req/Sec     0.86      1.73     5.00     79.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   37.60ms
 75.000%   53.50ms
 90.000%   78.85ms
 99.000%  347.65ms
 99.900%  531.46ms
 99.990%  531.46ms
 99.999%  531.46ms
100.000%  531.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.367     0.000000            1         1.00
      19.487     0.100000           29         1.11
      28.079     0.200000           58         1.25
      31.743     0.300000           87         1.43
      34.495     0.400000          116         1.67
      37.599     0.500000          145         2.00
      40.735     0.550000          160         2.22
      43.967     0.600000          174         2.50
      46.751     0.650000          189         2.86
      49.887     0.700000          203         3.33
      53.503     0.750000          218         4.00
      55.487     0.775000          225         4.44
      58.303     0.800000          232         5.00
      63.775     0.825000          240         5.71
      69.247     0.850000          247         6.67
      72.767     0.875000          254         8.00
      76.095     0.887500          258         8.89
      78.847     0.900000          261        10.00
      89.791     0.912500          265        11.43
      96.895     0.925000          269        13.33
     101.695     0.937500          272        16.00
     104.319     0.943750          274        17.78
     104.511     0.950000          276        20.00
     106.111     0.956250          278        22.86
     121.343     0.962500          280        26.67
     127.359     0.968750          281        32.00
     130.303     0.971875          282        35.56
     150.399     0.975000          283        40.00
     154.623     0.978125          284        45.71
     161.919     0.981250          285        53.33
     167.935     0.984375          286        64.00
     167.935     0.985938          286        71.11
     347.647     0.987500          287        80.00
     347.647     0.989062          287        91.43
     376.831     0.990625          288       106.67
     376.831     0.992188          288       128.00
     376.831     0.992969          288       142.22
     432.127     0.993750          289       160.00
     432.127     0.994531          289       182.86
     432.127     0.995313          289       213.33
     432.127     0.996094          289       256.00
     432.127     0.996484          289       284.44
     531.455     0.996875          290       320.00
     531.455     1.000000          290          inf
#[Mean    =       50.274, StdDeviation   =       51.631]
#[Max     =      530.944, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   36.38ms
 75.000%   52.74ms
 90.000%   77.57ms
 99.000%  346.62ms
 99.900%  529.92ms
 99.990%  529.92ms
 99.999%  529.92ms
100.000%  529.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.839     0.000000            1         1.00
      18.511     0.100000           29         1.11
      26.879     0.200000           58         1.25
      30.911     0.300000           87         1.43
      33.567     0.400000          116         1.67
      36.383     0.500000          145         2.00
      39.487     0.550000          160         2.22
      42.879     0.600000          174         2.50
      45.695     0.650000          189         2.86
      48.927     0.700000          203         3.33
      52.735     0.750000          218         4.00
      54.175     0.775000          225         4.44
      57.215     0.800000          232         5.00
      62.879     0.825000          240         5.71
      68.031     0.850000          247         6.67
      71.359     0.875000          254         8.00
      75.007     0.887500          258         8.89
      77.567     0.900000          261        10.00
      88.831     0.912500          265        11.43
      96.063     0.925000          269        13.33
     100.415     0.937500          272        16.00
     103.167     0.943750          274        17.78
     103.871     0.950000          276        20.00
     105.535     0.956250          278        22.86
     120.191     0.962500          280        26.67
     126.399     0.968750          281        32.00
     129.855     0.971875          282        35.56
     148.991     0.975000          283        40.00
     153.855     0.978125          284        45.71
     161.151     0.981250          285        53.33
     166.783     0.984375          286        64.00
     166.783     0.985938          286        71.11
     346.623     0.987500          287        80.00
     346.623     0.989062          287        91.43
     375.551     0.990625          288       106.67
     375.551     0.992188          288       128.00
     375.551     0.992969          288       142.22
     430.591     0.993750          289       160.00
     430.591     0.994531          289       182.86
     430.591     0.995313          289       213.33
     430.591     0.996094          289       256.00
     430.591     0.996484          289       284.44
     529.919     0.996875          290       320.00
     529.919     1.000000          290          inf
#[Mean    =       49.338, StdDeviation   =       51.579]
#[Max     =      529.408, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  300 requests in 5.00m, 386.39KB read
Requests/sec:      1.00
Transfer/sec:      1.29KB