HomeWork-3/reports/128M/withIndex/wrk2-R10.txt
Running 5m test @ http://localhost:5000
  4 threads and 5 connections
  Thread calibration: mean lat.: 342.322ms, rate sampling interval: 2238ms
  Thread calibration: mean lat.: 170.173ms, rate sampling interval: 1437ms
  Thread calibration: mean lat.: 170.068ms, rate sampling interval: 1441ms
  Thread calibration: mean lat.: 170.308ms, rate sampling interval: 1433ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.74ms   74.54ms 812.03ms   95.10%
    Req/Sec     2.01      0.16     3.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   24.29ms
 75.000%   36.35ms
 90.000%   52.77ms
 99.000%  434.43ms
 99.900%  731.65ms
 99.990%  812.54ms
 99.999%  812.54ms
100.000%  812.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.755     0.000000            1         1.00
      13.079     0.100000          291         1.11
      15.223     0.200000          580         1.25
      17.647     0.300000          873         1.43
      20.719     0.400000         1160         1.67
      24.287     0.500000         1451         2.00
      26.175     0.550000         1595         2.22
      28.927     0.600000         1741         2.50
      31.983     0.650000         1885         2.86
      34.559     0.700000         2035         3.33
      36.351     0.750000         2177         4.00
      37.439     0.775000         2248         4.44
      38.879     0.800000         2320         5.00
      40.511     0.825000         2393         5.71
      43.487     0.850000         2466         6.67
      46.751     0.875000         2539         8.00
      48.703     0.887500         2574         8.89
      52.767     0.900000         2610        10.00
      59.903     0.912500         2647        11.43
      70.655     0.925000         2683        13.33
      89.663     0.937500         2719        16.00
     101.439     0.943750         2737        17.78
     113.919     0.950000         2755        20.00
     149.631     0.956250         2774        22.86
     170.623     0.962500         2792        26.67
     205.951     0.968750         2810        32.00
     233.343     0.971875         2819        35.56
     262.655     0.975000         2829        40.00
     333.311     0.978125         2837        45.71
     378.879     0.981250         2846        53.33
     396.799     0.984375         2855        64.00
     406.783     0.985938         2860        71.11
     412.671     0.987500         2864        80.00
     417.535     0.989062         2869        91.43
     446.975     0.990625         2873       106.67
     491.007     0.992188         2880       128.00
     491.007     0.992969         2880       142.22
     513.023     0.993750         2882       160.00
     518.911     0.994531         2885       182.86
     571.903     0.995313         2887       213.33
     621.055     0.996094         2889       256.00
     621.567     0.996484         2890       284.44
     637.439     0.996875         2892       320.00
     638.463     0.997266         2893       365.71
     696.831     0.997656         2895       426.67
     696.831     0.998047         2895       512.00
     696.831     0.998242         2895       568.89
     697.343     0.998437         2896       640.00
     731.647     0.998633         2897       731.43
     731.647     0.998828         2897       853.33
     732.159     0.999023         2898      1024.00
     732.159     0.999121         2898      1137.78
     732.159     0.999219         2898      1280.00
     732.671     0.999316         2899      1462.86
     732.671     0.999414         2899      1706.67
     732.671     0.999512         2899      2048.00
     732.671     0.999561         2899      2275.56
     732.671     0.999609         2899      2560.00
     812.543     0.999658         2900      2925.71
     812.543     1.000000         2900          inf
#[Mean    =       41.742, StdDeviation   =       74.538]
#[Max     =      812.032, Total count    =         2900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   23.30ms
 75.000%   35.33ms
 90.000%   51.42ms
 99.000%  411.39ms
 99.900%  697.34ms
 99.990%  811.52ms
 99.999%  811.52ms
100.000%  811.52ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.307     0.000000            1         1.00
      12.095     0.100000          290         1.11
      14.167     0.200000          581         1.25
      16.623     0.300000          870         1.43
      19.679     0.400000         1160         1.67
      23.295     0.500000         1450         2.00
      25.215     0.550000         1596         2.22
      27.935     0.600000         1740         2.50
      30.959     0.650000         1885         2.86
      33.535     0.700000         2032         3.33
      35.327     0.750000         2176         4.00
      36.511     0.775000         2248         4.44
      37.919     0.800000         2320         5.00
      39.359     0.825000         2394         5.71
      42.207     0.850000         2465         6.67
      45.631     0.875000         2538         8.00
      47.647     0.887500         2575         8.89
      51.423     0.900000         2610        10.00
      58.335     0.912500         2647        11.43
      68.671     0.925000         2683        13.33
      82.879     0.937500         2720        16.00
      93.631     0.943750         2737        17.78
     101.503     0.950000         2755        20.00
     115.839     0.956250         2774        22.86
     155.775     0.962500         2792        26.67
     178.047     0.968750         2810        32.00
     196.351     0.971875         2819        35.56
     222.207     0.975000         2828        40.00
     234.239     0.978125         2837        45.71
     257.535     0.981250         2846        53.33
     339.967     0.984375         2855        64.00
     378.879     0.985938         2861        71.11
     387.327     0.987500         2864        80.00
     396.799     0.989062         2869        91.43
     414.975     0.990625         2873       106.67
     446.975     0.992188         2878       128.00
     481.023     0.992969         2880       142.22
     490.239     0.993750         2883       160.00
     512.255     0.994531         2885       182.86
     570.879     0.995313         2887       213.33
     620.031     0.996094         2889       256.00
     620.543     0.996484         2890       284.44
     636.415     0.996875         2892       320.00
     637.951     0.997266         2893       365.71
     695.807     0.997656         2894       426.67
     696.319     0.998047         2895       512.00
     696.319     0.998242         2895       568.89
     696.831     0.998437         2896       640.00
     697.343     0.998633         2897       731.43
     697.343     0.998828         2897       853.33
     697.855     0.999023         2899      1024.00
     697.855     0.999121         2899      1137.78
     697.855     0.999219         2899      1280.00
     697.855     0.999316         2899      1462.86
     697.855     0.999414         2899      1706.67
     697.855     0.999512         2899      2048.00
     697.855     0.999561         2899      2275.56
     697.855     0.999609         2899      2560.00
     811.519     0.999658         2900      2925.71
     811.519     1.000000         2900          inf
#[Mean    =       38.914, StdDeviation   =       68.710]
#[Max     =      811.008, Total count    =         2900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3003 requests in 5.00m, 3.78MB read
Requests/sec:     10.01
Transfer/sec:     12.89KB